In [2]:
import pandas as pd
x=pd.DataFrame({'name':['a','b','c','d','b','a','b','a','b'],
                'subject':[12,1,2,33,12,34,61,21,23],
                'subjet2':[2,1,2,3,12,14,11,11,63]})
x

  name  subject  subjet2
0    a       12        2
1    b        1        1
2    c        2        2
3    d       33        3
4    b       12       12
5    a       34       14
6    b       61       11
7    a       21       11
8    b       23       63

In [4]:
x1=x.groupby('name')
x1

In [6]:
for i,j in x1:
    print(i)
    print(j,"\n")

a
  name  subject  subjet2
0    a       12        2
5    a       34       14
7    a       21       11

b
  name  subject  subjet2
1    b        1        1
4    b       12       12
6    b       61       11
8    b       23       63

c
  name  subject  subjet2
2    c        2        2

d
  name  subject  subjet2
3    d       33        3

In [8]:
x1.get_group('a')

  name  subject  subjet2
0    a       12        2
5    a       34       14
7    a       21       11

In [9]:
x1.get_group("b")

  name  subject  subjet2
1    b        1        1
4    b       12       12
6    b       61       11
8    b       23       63

In [10]:
x1.min()

      subject  subjet2
name
a          12        2
b           1        1
c           2        2
d          33        3

In [11]:
x1.max()

      subject  subjet2
name
a          34       14
b          61       63
c           2        2
d          33        3

In [12]:
x1.mean()

        subject  subjet2
name
a     22.333333     9.00
b     24.250000    21.75
c      2.000000     2.00
d     33.000000     3.00

In [13]:
a=list(x1)
a

[('a',
    name  subject  subjet2
  0    a       12        2
  5    a       34       14
  7    a       21       11),
 ('b',
    name  subject  subjet2
  1    b        1        1
  4    b       12       12
  6    b       61       11
  8    b       23       63),
 ('c',
    name  subject  subjet2
  2    c        2        2),
 ('d',
    name  subject  subjet2
  3    d       33        3)]